render([

select("学校名称","SchoolName","[{\"text\":\"华侨大学\",\"value\":\"1\"},{\"text\":\"集美大学\",\"value\":\"2\"}]","请选择学校",4),

select("年级","Grade","[{\"text\":\"2013\",\"value\":\"1\"},{\"text\":\"2014\",\"value\":\"2\"}]","请选择年级",4),

select("专业名称","SpecialityName","[{\"text\":\"软件工程\",\"value\":\"1\"},{\"text\":\"网络工程\",\"value\":\"2\"}]","请选择专业名称",4),


input("班级序号", "ClassNo", "", 4, "请输入班级序号", "^[0-9]*$"),

input("班级编号", "Class_No", "", 4, "根据班级序号自动生成", "^[0-9]*$"),

input("班级名称", "ClassName", "", 4, "请输入班级名称", "")

]);