render([input('工号', 'user_id', '', '4', '请输入工号',''),
input('姓名', 'name', '', '4', '请输入姓名',''),
input('头像', 'img', '', '4', '请输入头像',''),
input('岗位', 'postion', '', '4', '请输入岗位',''),
input('手机', 'phone', '', '4', '请输入手机',''),
input('电话', 'tel', '', '4', '请输入电话',''),
input('邮箱', 'email', '', '4', '请输入邮箱',''),
input('部门', 'department', '', '4', '请输入部门',''),
input('分部门', 'div_department', '', '4', '请输入分部门',''),
input('工作地点', 'work_place', '', '4', '请输入工作地点',''),
input('所属机构', 'org', '', '4', '请输入所属机构',''),
input('上级机构', 'father_org', '', '4', '请输入上级机构','')
],'*');