render([
    tab([
        {
            title: "已发布的岗位列表：",
            content: [
               
            ]
        },
    ], 1),
    tab([
        {
            title: "发布新岗位：",
            content: [
                select("选择岗位：", "xzgw", "[{\"text\":\"餐饮部\",\"value\":\"1\"}]", "--餐饮部--", 4),
                area("岗位描述：", "gwms", "", 4, "", 120),
                area("岗位要求：", "gwyq", "", 4, "", 120),
                input("招聘人数：", "zprs", "", 4, "", "^[0-9]*$"),
                input("过期天数：", "gqts", "", 4, "", "^[0-9]*$"),
                input("薪资：", "xz", "", 4, "", "^[0-9]*$"),
                select("接收申请：", "jssq", "[{\"text\":\"是\",\"value\":\"1\"},{\"text\":\"否\",\"value\":\"2\"}]", "--请选择--", 4),
                button("发布", 6, Color.blue, function () {  }),
            ]
        },
    ], 1)
    
]);